clc

%1、数据的输入；

%人数（单位：万人）

sqrs=[20.55 22.44 25.37 27.13 29.35 30.1 30.96 34.06 36.42 38.09 39.13 39.99 41.93 44.59 47.30 52.89 55.73];

%机动车数（单位：万辆）

sqjdcs=[0.6 0.75 0.85 0.9 1.05 1.35 1.45 1.60 1.70 1.85 2.15 2.2 2.25 2.35 2.50 2.60 2.70];

%公路面积（单位：万平方千米）

sqglmj=[0.09 0.11 0.11 0.14 0.20 0.23 0.23 0.32 0.32 0.34 0.36 0.36 0.38 0.49 0.56 0.59 0.59];

%公路客运量（单位：万人）

glkyl=[5126 6217 7730 9145 10460 11387 12353 15750 18304 19836 21024 19490 20433 22598 25107 33442 36836];%

%公路货运量（单位：万吨）

glhyl=[1237 1379 1385 1399 1663 1714 1834 4322 8132 8936 11099 11203 10524 11115 13320 16762 18673];%

p=[sqrs;sqjdcs;sqglmj];      %输入数据矩阵

t=[glkyl;glhyl];             %目标数据矩阵

 
%2、数据的预处理；

%利用函数premnmx对数据进行归一化

[pn,minp,maxp,tn,mint,maxt]=premnmx(p,t);

dx=[-1,1;-1,1;-1,1];

 

%3、BP网络训练

net=newff(dx,[3,4,2],{'tansig','tansig','purelin'},'traingdx');

net.trainParam.show=100;                      %1000轮回显示一次结果

net.trainParam.Lr=0.05;                        %学习速率为0.05

net.trainParam.epochs=2000;                   %最大训练轮回为50000；

net.trainParam.goal=0.65*10^(-3);              %均方误差

net=train(net,pn,tn);


%4、数据仿真

%利用训练好的BP网络对原始数据进行仿真

%an=sim(net,pn);                       %用训练好的模型进行仿真

%a=postmnmx(an,mint,maxt);             %用仿真得到的数据还原为原始的数量级

 

%6、    对新数据进行预测；

%当用训练好的网络对新数据pnew进行预测时，也应作相应的处理

pnew=[56.76 59.17 60.63;
    2.85 2.95 3.1;
    0.67 0.69 0.79];

pnewn=tramnmx(pnew,minp,maxp);

anewn=sim(net,pnewn);

anew=postmnmx(anewn,mint,maxt);

%res1
kyl=anew(1,:);
% b=kyl;
% for i=1:1:size(kyl)
%     b(i)=vpa(kyl(i));
% end
ob1=[40548 42927 43462];

hyl=anew(2,:);
% c=hyl;
% for i=1:1:size(hyl)
%     c(i)=vpa(hyl(i));
% end
ob2=[20724 20803 21804];

%5、仿真数据和原始数据进行对比；

%本例音样本容有限使用训练数据进行测试，通常必须用新鲜数据进行测试

x=1990:1992;

figure(1);

subplot(211);plot(x,kyl,'r-o',x,ob1,'b--+');

legend('网络输出客运量','实际客运量');

xlabel('年份');ylabel('客运量/万人');

title('运用工具想客运量学习和测试对比图');


subplot(212);plot(x,hyl,'r-o',x,ob2,'b--+');

legend('网络输出货运量','实际货运量');

xlabel('年份');ylabel('货运量/万吨');

title('运用工具箱货运量学习和测试对比图');